ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
					<register>
						<name>debug</name>
						<description>debug.</description>
						<addressOffset>0xE0</addressOffset>
						<fields>
							<field>
								<name>debug_i</name>
								<lsb>1</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>debug_oe</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL0</name>
						<description>GPIO_CFGCTL0.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>real_gpio_1_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_1_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_1_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_1_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_1_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_1_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_1_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>real_gpio_0_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_0_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_0_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_0_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_0_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_0_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_0_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL1</name>
						<description>GPIO_CFGCTL1.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>real_gpio_3_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_3_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_3_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_3_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_3_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_3_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_3_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>real_gpio_2_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_2_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_2_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_2_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_2_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_2_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_2_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL2</name>
						<description>GPIO_CFGCTL2.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>real_gpio_5_func_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>reg_gpio_5_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_5_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_5_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_5_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_5_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_5_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>real_gpio_4_func_sel</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>reg_gpio_4_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_4_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_4_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_4_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_4_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_4_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL3</name>
						<description>GPIO_CFGCTL3.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_7_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_7_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_7_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_7_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_7_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_7_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_6_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_6_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_6_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_6_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_6_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_6_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL4</name>
						<description>GPIO_CFGCTL4.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_9_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_9_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_9_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_9_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_9_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_9_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_8_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_8_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_8_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_8_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_8_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_8_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL5</name>
						<description>GPIO_CFGCTL5.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_11_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_11_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_11_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_11_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_11_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_11_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_10_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_10_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_10_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_10_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_10_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_10_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL6</name>
						<description>GPIO_CFGCTL6.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_13_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_13_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_13_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_13_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_13_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_13_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_12_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_12_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_12_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_12_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_12_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_12_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL7</name>
						<description>GPIO_CFGCTL7.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_15_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_15_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_15_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_15_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_15_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_15_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_14_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_14_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_14_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_14_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_14_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_14_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL8</name>
						<description>GPIO_CFGCTL8.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_17_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_17_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_17_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_17_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_17_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_17_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_16_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_16_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_16_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_16_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_16_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_16_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL9</name>
						<description>GPIO_CFGCTL9.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_19_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_19_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_19_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_19_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_19_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_19_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_18_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_18_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_18_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_18_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_18_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_18_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL10</name>
						<description>GPIO_CFGCTL10.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_21_func_sel</name>
								<lsb>24</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>reg_gpio_21_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_21_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_21_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_21_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_21_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_20_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_20_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_20_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_20_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_20_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_20_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL11</name>
						<description>GPIO_CFGCTL11.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_23_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_23_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_23_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_23_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_23_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_22_func_sel</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>reg_gpio_22_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_22_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_22_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_22_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_22_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL12</name>
						<description>GPIO_CFGCTL12.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_25_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_25_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_25_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_25_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_25_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_24_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_24_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_24_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_24_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_24_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL13</name>
						<description>GPIO_CFGCTL13.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_27_pd</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>reg_gpio_27_pu</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>reg_gpio_27_drv</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>reg_gpio_27_smt</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>reg_gpio_27_ie</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>reg_gpio_26_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_26_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_26_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_26_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_26_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>GPIO_CFGCTL14</name>
						<description>GPIO_CFGCTL14.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>reg_gpio_28_pd</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>reg_gpio_28_pu</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>reg_gpio_28_drv</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>reg_gpio_28_smt</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>reg_gpio_28_ie</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
