ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>rf</name>
				<description>rf.</description>
				<baseAddress>0x40001000</baseAddress>
				<groupName>rf</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>rf_rev</name>
						<description>Silicon revision</description>
						<addressOffset>0x0</addressOffset>
						<fields>
							<field>
								<name>hw_rev</name>
								<lsb>16</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>fw_rev</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>rf_id</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm_ctrl_hw</name>
						<description>Digital Control</description>
						<addressOffset>0x4</addressOffset>
						<fields>
							<field>
								<name>rf_rc_state_value</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_fsm_st_int_set</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rf_fsm_st_int_clr</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rf_fsm_st_int</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rf_fsm_st_int_sel</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_rc_state_dbg_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>rf_rc_state_dbg</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rf_fsm_state</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_fsm_t2r_cal_mode</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rf_fsm_ctrl_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm_ctrl_sw</name>
						<description>rfsm status reg</description>
						<addressOffset>0x8</addressOffset>
						<fields>
							<field>
								<name>lo_unlocked</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>inc_cal_timeout</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>full_cal_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rf_fsm_sw_st_vld</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>rf_fsm_sw_st</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfctrl_hw_en</name>
						<description>Control logic switch</description>
						<addressOffset>0xC</addressOffset>
						<fields>
							<field>
								<name>adda_ctrl_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rbb_pkdet_out_rstn_ctrl_hw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>rbb_pkdet_en_ctrl_hw</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>sdm_ctrl_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>inc_fcal_ctrl_en_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>inc_acal_ctrl_en_hw</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lo_ctrl_hw</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>trxcal_ctrl_hw</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rbb_bw_ctrl_hw</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>lna_ctrl_hw</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tx_gain_ctrl_hw</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rx_gain_ctrl_hw</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>pu_ctrl_hw</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>temp_comp</name>
						<description>temp_comp.</description>
						<addressOffset>0x10</addressOffset>
						<fields>
							<field>
								<name>temp_comp_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>const_fcal</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>const_acal</name>
								<lsb>0</lsb>
								<msb>7</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfcal_status</name>
						<description>rfcal_status.</description>
						<addressOffset>0x14</addressOffset>
						<fields>
							<field>
								<name>dpd_status</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tenscal_status</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>pwdet_cal_status</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>riqcal_status_resv</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tiqcal_status_resv</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>lo_leakcal_status</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rccal_status</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tos_status</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ros_status</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>clkpll_cal_status</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>inc_acal_status</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>inc_fcal_status</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>acal_status</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>fcal_status</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>adc_oscal_status</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rcal_status</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfcal_status2</name>
						<description>rfcal_status2.</description>
						<addressOffset>0x18</addressOffset>
						<fields>
							<field>
								<name>dl_rfcal_table_status</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfcal_ctrlen</name>
						<description>Calibration mode register</description>
						<addressOffset>0x1C</addressOffset>
						<fields>
							<field>
								<name>dpd_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tsencal_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pwdet_cal_en</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>riqcal_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tiqcal_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_leakcal_en</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rccal_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>toscal_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>roscal_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>clkpll_cal_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>roscal_inc_en</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>acal_inc_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>fcal_inc_en</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>acal_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>fcal_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dl_rfcal_table_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>adc_oscal_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rcal_en_resv</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfcal_stateen</name>
						<description>rf calibration state enabl in full cal list</description>
						<addressOffset>0x20</addressOffset>
						<fields>
							<field>
								<name>rfcal_level</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>dpd_sten</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tsencal_sten</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pwdet_cal_sten</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>riqcal_sten</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tiqcal_sten</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>lo_leakcal_sten</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>rccal_sten</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>toscal_sten_resv</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>roscal_sten</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>clkpll_cal_sten</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>inc_acal_sten</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>inc_fcal_sten</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>acal_sten</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>fcal_sten</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>dl_rfcal_table_sten</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>adc_oscal_sten</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rcal_sten_resv</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>saradc_resv</name>
						<description>SARADC Control Registers</description>
						<addressOffset>0x24</addressOffset>
						<fields/>
					</register>
					<register>
						<name>rf_base_ctrl1</name>
						<description>ZRF Control register 0</description>
						<addressOffset>0x28</addressOffset>
						<fields>
							<field>
								<name>mbg_trim</name>
								<lsb>27</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>pud_pa_dly</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pud_iref_dly</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pud_vco_dly</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ppu_lead</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_sdm_rst_dly</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>aupll_sdm_rst_dly</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_base_ctrl2</name>
						<description>ZRF Control register 0</description>
						<addressOffset>0x2C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>pucr1</name>
						<description>pucr1.</description>
						<addressOffset>0x30</addressOffset>
						<fields>
							<field>
								<name>pu_tosdac</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pu_pwrmx</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>pu_rosdac</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>pu_pkdet</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>trsw_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>pu_txbuf</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>pu_rxbuf</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>pu_osmx</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pfd</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_fbdv</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_vco</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_dac</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_tbb</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_tmx</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_pa</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pu_op_atest</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pu_adc</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>adc_clk_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_adda_ldo</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_rbb</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_rmx</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>pu_rmxgm</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>pu_lna</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pu_sfreg</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr1_hw</name>
						<description>read only from hardware logic</description>
						<addressOffset>0x34</addressOffset>
						<fields>
							<field>
								<name>pu_tosdac_hw</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>pu_rosdac_hw</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>pu_pkdet_hw</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>trsw_en_hw</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>pu_txbuf_hw</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>pu_rxbuf_hw</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>pu_osmx_hw</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>pu_pfd_hw</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pu_fbdv_hw</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pu_vco_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>pu_dac_hw</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pu_tbb_hw</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>pu_tmx_hw</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>pu_pa_hw</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pu_adc_hw</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>adc_clk_en_hw</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>pu_adda_ldo_hw</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>pu_rbb_hw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>pu_rmx_hw</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>pu_rmxgm_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>pu_lna_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pu_sfreg_hw</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pucr2</name>
						<description>pucr2.</description>
						<addressOffset>0x38</addressOffset>
						<fields/>
					</register>
					<register>
						<name>pucr2_hw</name>
						<description>pucr2_hw.</description>
						<addressOffset>0x3C</addressOffset>
						<fields/>
					</register>
					<register>
						<name>ppu_ctrl_hw</name>
						<description>ppu_ctrl_hw.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>ppu_txbuf_hw</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ppu_rxbuf_hw</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>ppu_osmx_hw</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>ppu_pfd_hw</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ppu_fbdv_hw</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ppu_vco_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ppu_rbb_hw</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>ppu_rmxgm_hw</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ppu_lna_hw</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pud_ctrl_hw</name>
						<description>pud_ctrl_hw.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>pud_vco_hw</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>trx_gain1</name>
						<description>gain control1</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>gc_tbb_boost</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gc_tbb</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gc_tmx</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gc_rmxgm</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gc_lna</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>trx_gain_hw</name>
						<description>trx gain hardware readback</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>gc_tbb_boost_hw</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gc_tbb_hw</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gc_tmx_hw</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>gc_rbb2_hw</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gc_rbb1_hw</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gc_rmxgm_hw</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gc_lna_hw</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>ten_dc</name>
						<description>dc test register</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>ten_lodist</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>ten_lf</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>ten_pfdcp</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>ten_vco</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>ten_dac_q</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>ten_dac_i</name>
								<lsb>21</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>ten_adc</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>ten_tbb</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>ten_atest</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>ten_bq</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>ten_tia</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>ten_tmx</name>
								<lsb>15</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>ten_pa</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>ten_rrf_1</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>ten_rrf_0</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>ten_clkpll_sfreg</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>ten_clkpll</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>dc_tp_clkpll_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>dc_tp_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tmux</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
