ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
					<register>
						<name>rrf_gain_index1</name>
						<description>rrf_gain_index1.</description>
						<addressOffset>0xF8</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl5_gc_lna</name>
								<lsb>27</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl5_gc_rmxgm</name>
								<lsb>25</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_lna</name>
								<lsb>22</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_rmxgm</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>gain_ctrl3_gc_lna</name>
								<lsb>17</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gain_ctrl3_gc_rmxgm</name>
								<lsb>15</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_lna</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_rmxgm</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_lna</name>
								<lsb>7</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_rmxgm</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_lna</name>
								<lsb>2</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_rmxgm</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rrf_gain_index2</name>
						<description>rrf_gain_index2.</description>
						<addressOffset>0xFC</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl6_gc_lna</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_rmxgm</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>gain_ctrl7_gc_lna</name>
								<lsb>7</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl7_gc_rmxgm</name>
								<lsb>5</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl8_gc_lna</name>
								<lsb>2</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gain_ctrl8_gc_rmxgm</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lna_ctrl_hw_mux</name>
						<description>lna_ctrl_hw_mux.</description>
						<addressOffset>0x100</addressOffset>
						<fields>
							<field>
								<name>lna_load_csw_lg</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lna_load_csw_hg</name>
								<lsb>8</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lna_bm_lg</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lna_bm_hg</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_index1</name>
						<description>rbb_gain_index1.</description>
						<addressOffset>0x104</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl3_gc_rbb2</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gain_ctrl3_gc_rbb1</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_rbb2</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_rbb1</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_rbb2</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_rbb1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_index2</name>
						<description>rbb_gain_index2.</description>
						<addressOffset>0x108</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl7_gc_rbb2</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gain_ctrl7_gc_rbb1</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_rbb2</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_rbb1</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl5_gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl5_gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_rbb2</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_rbb1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_index3</name>
						<description>rbb_gain_index3.</description>
						<addressOffset>0x10C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl11_gc_rbb2</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gain_ctrl11_gc_rbb1</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gain_ctrl10_gc_rbb2</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gain_ctrl10_gc_rbb1</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl9_gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl9_gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl8_gc_rbb2</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl8_gc_rbb1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_index4</name>
						<description>rbb_gain_index4.</description>
						<addressOffset>0x110</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl15_gc_rbb2</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>gain_ctrl15_gc_rbb1</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>gain_ctrl14_gc_rbb2</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>gain_ctrl14_gc_rbb1</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>gain_ctrl13_gc_rbb2</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gain_ctrl13_gc_rbb1</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gain_ctrl12_gc_rbb2</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl12_gc_rbb1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_gain_index5</name>
						<description>rbb_gain_index5.</description>
						<addressOffset>0x114</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl16_gc_rbb2</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>gain_ctrl16_gc_rbb1</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tbb_gain_index1</name>
						<description>tbb_gain_index1.</description>
						<addressOffset>0x118</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl1_gc_tbb_boost</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gain_ctrl1_dac_bias_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_tmx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl1_gc_tbb</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_tbb_boost</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gain_ctrl0_dac_bias_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_tmx</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gain_ctrl0_gc_tbb</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tbb_gain_index2</name>
						<description>tbb_gain_index2.</description>
						<addressOffset>0x11C</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl3_gc_tbb_boost</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gain_ctrl3_dac_bias_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl3_gc_tmx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl3_gc_tbb</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_tbb_boost</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gain_ctrl2_dac_bias_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_tmx</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gain_ctrl2_gc_tbb</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tbb_gain_index3</name>
						<description>tbb_gain_index3.</description>
						<addressOffset>0x120</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl5_gc_tbb_boost</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gain_ctrl5_dac_bias_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl5_gc_tmx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl5_gc_tbb</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_tbb_boost</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gain_ctrl4_dac_bias_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_tmx</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gain_ctrl4_gc_tbb</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tbb_gain_index4</name>
						<description>tbb_gain_index4.</description>
						<addressOffset>0x124</addressOffset>
						<fields>
							<field>
								<name>gain_ctrl7_gc_tbb_boost</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gain_ctrl7_dac_bias_sel</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gain_ctrl7_gc_tmx</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>gain_ctrl7_gc_tbb</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_tbb_boost</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>gain_ctrl6_dac_bias_sel</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_tmx</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>gain_ctrl6_gc_tbb</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa_reg_ctrl_hw1</name>
						<description>pa_reg_ctrl_hw1.</description>
						<addressOffset>0x128</addressOffset>
						<fields>
							<field>
								<name>pa_vbcas_11n</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_vbcore_11n</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pa_iet_11n</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa_reg_ctrl_hw2</name>
						<description>pa_reg_ctrl_hw2.</description>
						<addressOffset>0x12C</addressOffset>
						<fields>
							<field>
								<name>pa_vbcas_11b</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>pa_vbcore_11b</name>
								<lsb>16</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>pa_iet_11b</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>pa_vbcas_11g</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>pa_vbcore_11g</name>
								<lsb>4</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>pa_iet_11g</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>pa_reg_wifi_ctrl_hw</name>
						<description>pa_reg_wifi_ctrl_hw.</description>
						<addressOffset>0x130</addressOffset>
						<fields>
							<field>
								<name>pa_ib_fix_wifi</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>pa_etb_en_wifi</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>pa_half_on_wifi</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>adda_reg_ctrl_hw</name>
						<description>adda_reg_ctrl_hw.</description>
						<addressOffset>0x134</addressOffset>
						<fields>
							<field>
								<name>adda_ldo_dvdd_sel_tx</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>adda_ldo_dvdd_sel_rx</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_reg_ctrl_hw1</name>
						<description>lo_reg_ctrl_hw1.</description>
						<addressOffset>0x138</addressOffset>
						<fields>
							<field>
								<name>lo_lf_r4_tx</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>lo_lf_r4_rx</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lo_lf_rz_tx</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_lf_rz_rx</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_lf_cz_tx</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_lf_cz_rx</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_cp_sel_tx</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>lo_cp_sel_rx</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>lo_fbdv_halfstep_en_tx</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>lo_fbdv_halfstep_en_rx</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw1</name>
						<description>lo_cal_ctrl_hw1.</description>
						<addressOffset>0x13C</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2408</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2408</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2404</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2404</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw2</name>
						<description>lo_cal_ctrl_hw2.</description>
						<addressOffset>0x140</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2416</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2416</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2412</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2412</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw3</name>
						<description>lo_cal_ctrl_hw3.</description>
						<addressOffset>0x144</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2424</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2424</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2420</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2420</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw4</name>
						<description>lo_cal_ctrl_hw4.</description>
						<addressOffset>0x148</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2432</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2432</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2428</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2428</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw5</name>
						<description>lo_cal_ctrl_hw5.</description>
						<addressOffset>0x14C</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2440</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2440</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2436</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2436</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw6</name>
						<description>lo_cal_ctrl_hw6.</description>
						<addressOffset>0x150</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2448</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2448</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2444</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2444</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw7</name>
						<description>lo_cal_ctrl_hw7.</description>
						<addressOffset>0x154</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2456</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2456</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2452</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2452</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw8</name>
						<description>lo_cal_ctrl_hw8.</description>
						<addressOffset>0x158</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2464</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2464</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2460</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2460</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw9</name>
						<description>lo_cal_ctrl_hw9.</description>
						<addressOffset>0x15C</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2472</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2472</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2468</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2468</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw10</name>
						<description>lo_cal_ctrl_hw10.</description>
						<addressOffset>0x160</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2480</name>
								<lsb>24</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2480</name>
								<lsb>16</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>lo_vco_freq_cw_2476</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2476</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_cal_ctrl_hw11</name>
						<description>lo_cal_ctrl_hw11.</description>
						<addressOffset>0x164</addressOffset>
						<fields>
							<field>
								<name>lo_vco_freq_cw_2484</name>
								<lsb>8</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_vco_idac_cw_2484</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rosdac_ctrl_hw1</name>
						<description>rosdac_ctrl_hw1.</description>
						<addressOffset>0x168</addressOffset>
						<fields>
							<field>
								<name>rosdac_q_gc1</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rosdac_i_gc1</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rosdac_q_gc0</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rosdac_i_gc0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
