ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
					<register>
						<name>rosdac_ctrl_hw2</name>
						<description>rosdac_ctrl_hw2.</description>
						<addressOffset>0x16C</addressOffset>
						<fields>
							<field>
								<name>rosdac_q_gc3</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rosdac_i_gc3</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>rosdac_q_gc2</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>rosdac_i_gc2</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxiq_ctrl_hw1</name>
						<description>rxiq_ctrl_hw1.</description>
						<addressOffset>0x170</addressOffset>
						<fields>
							<field>
								<name>rx_iq_gain_comp_gc0</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rx_iq_phase_comp_gc0</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxiq_ctrl_hw2</name>
						<description>rxiq_ctrl_hw2.</description>
						<addressOffset>0x174</addressOffset>
						<fields>
							<field>
								<name>rx_iq_gain_comp_gc1</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rx_iq_phase_comp_gc1</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxiq_ctrl_hw3</name>
						<description>rxiq_ctrl_hw3.</description>
						<addressOffset>0x178</addressOffset>
						<fields>
							<field>
								<name>rx_iq_gain_comp_gc2</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rx_iq_phase_comp_gc2</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rxiq_ctrl_hw4</name>
						<description>rxiq_ctrl_hw4.</description>
						<addressOffset>0x17C</addressOffset>
						<fields>
							<field>
								<name>rx_iq_gain_comp_gc3</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rx_iq_phase_comp_gc3</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tosdac_ctrl_hw1</name>
						<description>tosdac_ctrl_hw1.</description>
						<addressOffset>0x180</addressOffset>
						<fields>
							<field>
								<name>tbb_tosdac_q_gc1</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc1</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tbb_tosdac_q_gc0</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc0</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tosdac_ctrl_hw2</name>
						<description>tosdac_ctrl_hw2.</description>
						<addressOffset>0x184</addressOffset>
						<fields>
							<field>
								<name>tbb_tosdac_q_gc3</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc3</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tbb_tosdac_q_gc2</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc2</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tosdac_ctrl_hw3</name>
						<description>tosdac_ctrl_hw3.</description>
						<addressOffset>0x188</addressOffset>
						<fields>
							<field>
								<name>tbb_tosdac_q_gc5</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc5</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tbb_tosdac_q_gc4</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc4</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tosdac_ctrl_hw4</name>
						<description>tosdac_ctrl_hw4.</description>
						<addressOffset>0x18C</addressOffset>
						<fields>
							<field>
								<name>tbb_tosdac_q_gc7</name>
								<lsb>24</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc7</name>
								<lsb>16</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>tbb_tosdac_q_gc6</name>
								<lsb>8</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tbb_tosdac_i_gc6</name>
								<lsb>0</lsb>
								<msb>5</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw0</name>
						<description>tx_iq_gain_hw0.</description>
						<addressOffset>0x190</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc0</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc0</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw1</name>
						<description>tx_iq_gain_hw1.</description>
						<addressOffset>0x194</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc1</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc1</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw2</name>
						<description>tx_iq_gain_hw2.</description>
						<addressOffset>0x198</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc2</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc2</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw3</name>
						<description>tx_iq_gain_hw3.</description>
						<addressOffset>0x19C</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc3</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc3</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw4</name>
						<description>tx_iq_gain_hw4.</description>
						<addressOffset>0x1A0</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc4</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc4</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw5</name>
						<description>tx_iq_gain_hw5.</description>
						<addressOffset>0x1A4</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc5</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc5</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw6</name>
						<description>tx_iq_gain_hw6.</description>
						<addressOffset>0x1A8</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc6</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc6</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tx_iq_gain_hw7</name>
						<description>tx_iq_gain_hw7.</description>
						<addressOffset>0x1AC</addressOffset>
						<fields>
							<field>
								<name>tx_iq_gain_comp_gc7</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tx_iq_phase_comp_gc7</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw1</name>
						<description>lo_sdm_ctrl_hw1.</description>
						<addressOffset>0x1B0</addressOffset>
						<fields>
							<field>
								<name>lo_sdm_dither_sel_wlan_2484</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2472</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2467</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2462</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2457</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2452</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2447</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2442</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2437</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2432</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2427</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2422</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2417</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_wlan_2412</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw2</name>
						<description>lo_sdm_ctrl_hw2.</description>
						<addressOffset>0x1B4</addressOffset>
						<fields>
							<field>
								<name>lo_sdm_dither_sel_ble_2432</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2430</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2428</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2426</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2424</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2422</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2420</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2418</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2416</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2414</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2412</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2410</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2408</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2406</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2404</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2402</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw3</name>
						<description>lo_sdm_ctrl_hw3.</description>
						<addressOffset>0x1B8</addressOffset>
						<fields>
							<field>
								<name>lo_sdm_dither_sel_ble_2464</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2462</name>
								<lsb>28</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2460</name>
								<lsb>26</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2458</name>
								<lsb>24</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2456</name>
								<lsb>22</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2454</name>
								<lsb>20</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2452</name>
								<lsb>18</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2450</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2448</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2446</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2444</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2442</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2440</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2438</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2436</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2434</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw4</name>
						<description>lo_sdm_ctrl_hw4.</description>
						<addressOffset>0x1BC</addressOffset>
						<fields>
							<field>
								<name>lo_sdm_dither_sel_ble_tx</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2480</name>
								<lsb>14</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2478</name>
								<lsb>12</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2476</name>
								<lsb>10</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2474</name>
								<lsb>8</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2472</name>
								<lsb>6</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2470</name>
								<lsb>4</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2468</name>
								<lsb>2</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>lo_sdm_dither_sel_ble_2466</name>
								<lsb>0</lsb>
								<msb>1</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw5</name>
						<description>lo_sdm_ctrl_hw5.</description>
						<addressOffset>0x1C0</addressOffset>
						<fields>
							<field>
								<name>lo_sdm_bypass_mode</name>
								<lsb>12</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>lo_center_freq_mhz</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw6</name>
						<description>lo_sdm_ctrl_hw6.</description>
						<addressOffset>0x1C4</addressOffset>
						<fields>
							<field>
								<name>lo_sdmin_center</name>
								<lsb>0</lsb>
								<msb>28</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw7</name>
						<description>lo_sdm_ctrl_hw7.</description>
						<addressOffset>0x1C8</addressOffset>
						<fields>
							<field>
								<name>lo_sdmin_1m</name>
								<lsb>0</lsb>
								<msb>19</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>lo_sdm_ctrl_hw8</name>
						<description>lo_sdm_ctrl_hw8.</description>
						<addressOffset>0x1CC</addressOffset>
						<fields>
							<field>
								<name>lo_sdmin_if</name>
								<lsb>0</lsb>
								<msb>19</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rbb_bw_ctrl_hw</name>
						<description>rbb_bw_ctrl_hw.</description>
						<addressOffset>0x1D0</addressOffset>
						<fields>
							<field>
								<name>rbb_bt_mode_ble</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>singen_ctrl0</name>
						<description>singen_ctrl0.</description>
						<addressOffset>0x20C</addressOffset>
						<fields>
							<field>
								<name>singen_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_clkdiv_n</name>
								<lsb>29</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>singen_unsign_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>singen_inc_step0</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>singen_inc_step1</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>singen_ctrl1</name>
						<description>singen_ctrl1.</description>
						<addressOffset>0x210</addressOffset>
						<fields>
							<field>
								<name>singen_mode_i</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_clkdiv_i</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>singen_mode_q</name>
								<lsb>12</lsb>
								<msb>15</msb>
							</field>
							<field>
								<name>singen_clkdiv_q</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>singen_ctrl2</name>
						<description>singen_ctrl2.</description>
						<addressOffset>0x214</addressOffset>
						<fields>
							<field>
								<name>singen_start_addr0_i</name>
								<lsb>22</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_start_addr1_i</name>
								<lsb>12</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>singen_gain_i</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>singen_ctrl3</name>
						<description>singen_ctrl3.</description>
						<addressOffset>0x218</addressOffset>
						<fields>
							<field>
								<name>singen_start_addr0_q</name>
								<lsb>22</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>singen_start_addr1_q</name>
								<lsb>12</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>singen_gain_q</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>singen_ctrl4</name>
						<description>singen_ctrl4.</description>
						<addressOffset>0x21C</addressOffset>
						<fields>
							<field>
								<name>singen_fix_en_i</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>singen_fix_i</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>singen_fix_en_q</name>
								<lsb>12</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>singen_fix_q</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfif_dfe_ctrl0</name>
						<description>rfif_dfe_ctrl0.</description>
						<addressOffset>0x220</addressOffset>
						<fields>
							<field>
								<name>test_sel</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>bbmode_4s_en</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>bbmode_4s</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>wifimode_4s_en</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>wifimode_4s</name>
								<lsb>23</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rf_ch_ind_ble_4s_en</name>
								<lsb>22</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_ch_ind_ble_4s</name>
								<lsb>15</lsb>
								<msb>21</msb>
							</field>
							<field>
								<name>pad_dac_clkout_inv_en</name>
								<lsb>14</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>pad_adc_clkout_inv_en</name>
								<lsb>13</lsb>
								<msb>13</msb>
							</field>
							<field>
								<name>tx_test_sel</name>
								<lsb>11</lsb>
								<msb>12</msb>
							</field>
							<field>
								<name>rx_test_sel</name>
								<lsb>9</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tx_dfe_en_4s_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tx_dfe_en_4s</name>
								<lsb>7</lsb>
								<msb>7</msb>
							</field>
							<field>
								<name>rx_dfe_en_4s_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rx_dfe_en_4s</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rfckg_dac_afifo_inv</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rfckg_adc_clkout_sel</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rfckg_adc_afifo_inv</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rfckg_txclk_4s_on</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rfckg_rxclk_4s_on</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rfif_test_read</name>
						<description>rfif_test_read.</description>
						<addressOffset>0x224</addressOffset>
						<fields>
							<field>
								<name>test_read</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
