ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
					<register>
						<name>rfif_dig_ctrl</name>
						<description>rfif_dig_ctrl.</description>
						<addressOffset>0x228</addressOffset>
						<fields>
							<field>
								<name>rfif_ppud_manaual_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rfif_ppud_cnt1</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rfif_ppud_cnt2</name>
								<lsb>16</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>rfif_int_lo_unlocked_mask</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rfckg_rxclk_div2_mode</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>test_gc_from_pad_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>test_from_pad_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_data_temp_0</name>
						<description>rf_data_temp_0.</description>
						<addressOffset>0x22C</addressOffset>
						<fields>
							<field>
								<name>rf_data_temp_0</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_data_temp_1</name>
						<description>rf_data_temp_1.</description>
						<addressOffset>0x230</addressOffset>
						<fields>
							<field>
								<name>rf_data_temp_1</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_data_temp_2</name>
						<description>rf_data_temp_2.</description>
						<addressOffset>0x234</addressOffset>
						<fields>
							<field>
								<name>rf_data_temp_2</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_data_temp_3</name>
						<description>rf_data_temp_3.</description>
						<addressOffset>0x238</addressOffset>
						<fields>
							<field>
								<name>rf_data_temp_3</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl0</name>
						<description>rf_sram_ctrl0.</description>
						<addressOffset>0x23C</addressOffset>
						<fields>
							<field>
								<name>rf_sram_ext_clr</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_sram_swap</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_sram_link_mode</name>
								<lsb>16</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rf_sram_link_dly</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl1</name>
						<description>rf_sram_ctrl1.</description>
						<addressOffset>0x240</addressOffset>
						<fields>
							<field>
								<name>rf_sram_adc_done_cnt</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_adc_sts_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rf_sram_adc_loop_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rf_sram_adc_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rf_sram_adc_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl2</name>
						<description>rf_sram_ctrl2.</description>
						<addressOffset>0x244</addressOffset>
						<fields>
							<field>
								<name>rf_sram_adc_addr_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_adc_addr_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl3</name>
						<description>rf_sram_ctrl3.</description>
						<addressOffset>0x248</addressOffset>
						<fields>
							<field>
								<name>rf_sram_adc_sts</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl4</name>
						<description>rf_sram_ctrl4.</description>
						<addressOffset>0x24C</addressOffset>
						<fields>
							<field>
								<name>rf_sram_dac_done_cnt</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_dac_sts_clr</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rf_sram_dac_loop_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>rf_sram_dac_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>rf_sram_dac_done</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl5</name>
						<description>rf_sram_ctrl5.</description>
						<addressOffset>0x250</addressOffset>
						<fields>
							<field>
								<name>rf_sram_dac_addr_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_sram_dac_addr_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_sram_ctrl6</name>
						<description>rf_sram_ctrl6.</description>
						<addressOffset>0x254</addressOffset>
						<fields>
							<field>
								<name>rf_sram_dac_sts</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_ical_ctrl0</name>
						<description>rf_ical_ctrl0.</description>
						<addressOffset>0x258</addressOffset>
						<fields>
							<field>
								<name>rf_ical_f_ud_inv_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rf_ical_a_ud_inv_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_ical_f_cnt_n</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rf_ical_a_cnt_n</name>
								<lsb>10</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_ical_r_cnt_n</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_ical_ctrl1</name>
						<description>rf_ical_ctrl1.</description>
						<addressOffset>0x25C</addressOffset>
						<fields>
							<field>
								<name>rf_ical_r_os_i</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rf_ical_r_os_q</name>
								<lsb>10</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_ical_r_avg_n</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_ical_ctrl2</name>
						<description>rf_ical_ctrl2.</description>
						<addressOffset>0x260</addressOffset>
						<fields>
							<field>
								<name>rf_ical_period_n</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm_ctrl0</name>
						<description>rf_fsm_ctrl0.</description>
						<addressOffset>0x264</addressOffset>
						<fields>
							<field>
								<name>rf_ch_ind_wifi</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm_ctrl1</name>
						<description>rf_fsm_ctrl1.</description>
						<addressOffset>0x268</addressOffset>
						<fields>
							<field>
								<name>rf_fsm_pu_pa_dly_n</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rf_fsm_lo_rdy_sbclr</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_fsm_lo_rdy_4s_1</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_fsm_lo_rdy_rst</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>rf_fsm_lo_rdy</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>rf_fsm_lo_time</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_fsm_ctrl2</name>
						<description>rf_fsm_ctrl2.</description>
						<addressOffset>0x26C</addressOffset>
						<fields>
							<field>
								<name>rf_fsm_dfe_rx_dly_n</name>
								<lsb>20</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rf_fsm_dfe_tx_dly_n</name>
								<lsb>10</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>rf_trx_ble_4s_en</name>
								<lsb>6</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_trx_sw_ble_4s</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>rf_trx_en_ble_4s</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>rf_fsm_st_dbg_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>rf_fsm_st_dbg</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>rf_pkdet_ctrl0</name>
						<description>rf_pkdet_ctrl0.</description>
						<addressOffset>0x270</addressOffset>
						<fields>
							<field>
								<name>pkdet_out_mode</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>pkdet_out_cnt_en</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>pkdet_out_cnt_sts</name>
								<lsb>0</lsb>
								<msb>3</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_0</name>
						<description>dfe_ctrl_0.</description>
						<addressOffset>0x600</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_ctrl_hw</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_iqc_gain_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>tx_iqc_gain</name>
								<lsb>12</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_iqc_phase_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tx_iqc_phase</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_1</name>
						<description>dfe_ctrl_1.</description>
						<addressOffset>0x604</addressOffset>
						<fields>
							<field>
								<name>tx_dac_iq_swap</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tx_dac_dat_format</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_dac_os_q</name>
								<lsb>16</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tx_dac_os_i</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_2</name>
						<description>dfe_ctrl_2.</description>
						<addressOffset>0x608</addressOffset>
						<fields>
							<field>
								<name>rx_adc_iq_swap</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rx_adc_dat_format</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rx_adc_low_pow_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rx_adc_dce_flt_en</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rx_adc_os_q</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rx_adc_os_i</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_3</name>
						<description>dfe_ctrl_3.</description>
						<addressOffset>0x60C</addressOffset>
						<fields>
							<field>
								<name>rx_adc_4s_q_en</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rx_adc_4s_q_val</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rx_adc_4s_i_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rx_adc_4s_i_val</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_4</name>
						<description>dfe_ctrl_4.</description>
						<addressOffset>0x610</addressOffset>
						<fields>
							<field>
								<name>rx_pf_i_en</name>
								<lsb>31</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rx_pf_q_en</name>
								<lsb>30</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rx_pf_th1</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>rx_pf_th2</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_5</name>
						<description>dfe_ctrl_5.</description>
						<addressOffset>0x614</addressOffset>
						<fields>
							<field>
								<name>rx_iqc_gain_en</name>
								<lsb>23</lsb>
								<msb>23</msb>
							</field>
							<field>
								<name>rx_iqc_gain</name>
								<lsb>12</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rx_iqc_phase_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rx_iqc_phase</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_6</name>
						<description>dfe_ctrl_6.</description>
						<addressOffset>0x618</addressOffset>
						<fields>
							<field>
								<name>rx_pm_in_sel</name>
								<lsb>30</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rx_pm_en</name>
								<lsb>29</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>rx_pm_done</name>
								<lsb>28</lsb>
								<msb>28</msb>
							</field>
							<field>
								<name>rx_pm_freqshift_en</name>
								<lsb>20</lsb>
								<msb>20</msb>
							</field>
							<field>
								<name>rx_pm_freqshift_cw</name>
								<lsb>0</lsb>
								<msb>19</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_7</name>
						<description>dfe_ctrl_7.</description>
						<addressOffset>0x61C</addressOffset>
						<fields>
							<field>
								<name>rx_pm_acc_len</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>rx_pm_start_ofs</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_8</name>
						<description>dfe_ctrl_8.</description>
						<addressOffset>0x620</addressOffset>
						<fields>
							<field>
								<name>rx_pm_iqacc_i</name>
								<lsb>0</lsb>
								<msb>24</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_9</name>
						<description>dfe_ctrl_9.</description>
						<addressOffset>0x624</addressOffset>
						<fields>
							<field>
								<name>rx_pm_iqacc_q</name>
								<lsb>0</lsb>
								<msb>24</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_10</name>
						<description>dfe_ctrl_10.</description>
						<addressOffset>0x628</addressOffset>
						<fields>
							<field>
								<name>dfe_dac_raw_q</name>
								<lsb>16</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>dfe_dac_raw_i</name>
								<lsb>0</lsb>
								<msb>10</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_11</name>
						<description>dfe_ctrl_11.</description>
						<addressOffset>0x62C</addressOffset>
						<fields>
							<field>
								<name>dfe_adc_raw_q</name>
								<lsb>16</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>dfe_adc_raw_i</name>
								<lsb>0</lsb>
								<msb>9</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_12</name>
						<description>dfe_ctrl_12.</description>
						<addressOffset>0x630</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_gc3</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc2</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc1</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc0</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_13</name>
						<description>dfe_ctrl_13.</description>
						<addressOffset>0x634</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_gc7</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc6</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc5</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc4</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_14</name>
						<description>dfe_ctrl_14.</description>
						<addressOffset>0x638</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_gc11</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc10</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc9</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc8</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_15</name>
						<description>dfe_ctrl_15.</description>
						<addressOffset>0x63C</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_gc15</name>
								<lsb>24</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc14</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc13</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_gc12</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_16</name>
						<description>dfe_ctrl_16.</description>
						<addressOffset>0x640</addressOffset>
						<fields>
							<field>
								<name>rf_tbb_ind_gc7</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc6</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc5</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc4</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc3</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc2</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc1</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc0</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_17</name>
						<description>dfe_ctrl_17.</description>
						<addressOffset>0x644</addressOffset>
						<fields>
							<field>
								<name>rf_tbb_ind_gc15</name>
								<lsb>28</lsb>
								<msb>30</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc14</name>
								<lsb>24</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc13</name>
								<lsb>20</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc12</name>
								<lsb>16</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc11</name>
								<lsb>12</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc10</name>
								<lsb>8</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc9</name>
								<lsb>4</lsb>
								<msb>6</msb>
							</field>
							<field>
								<name>rf_tbb_ind_gc8</name>
								<lsb>0</lsb>
								<msb>2</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>dfe_ctrl_18</name>
						<description>dfe_ctrl_18.</description>
						<addressOffset>0x648</addressOffset>
						<fields>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc2</name>
								<lsb>16</lsb>
								<msb>22</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc1</name>
								<lsb>8</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>tx_dvga_gain_qdb_ble_gc0</name>
								<lsb>0</lsb>
								<msb>6</msb>
							</field>
						</fields>
					</register>
