ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
				</registers>
			</peripheral>
			<peripheral>
				<name>tzc_sec</name>
				<description>tzc_sec.</description>
				<baseAddress>0x40005000</baseAddress>
				<groupName>tzc_sec</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>tzc_rom_ctrl</name>
						<description>tzc_rom_ctrl.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>tzc_sboot_done</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id1_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id1_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id1_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id1_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id0_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r0</name>
						<description>tzc_rom0_r0.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>tzc_rom0_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r1</name>
						<description>tzc_rom0_r1.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>tzc_rom0_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r0</name>
						<description>tzc_rom1_r0.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>tzc_rom1_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r1</name>
						<description>tzc_rom1_r1.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>tzc_rom1_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
			<peripheral>
				<name>tzc_nsec</name>
				<description>tzc_nsec.</description>
				<baseAddress>0x40006000</baseAddress>
				<groupName>tzc_nsec</groupName>
				<size>32</size>
				<access>read-write</access>
				<addressBlock>
					<offset>0</offset>
					<size>0x1000</size>
					<usage>registers</usage>
				</addressBlock>
				<registers>
					<register>
						<name>tzc_rom_ctrl</name>
						<description>tzc_rom_ctrl.</description>
						<addressOffset>0x40</addressOffset>
						<fields>
							<field>
								<name>tzc_sboot_done</name>
								<lsb>28</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_lock</name>
								<lsb>27</lsb>
								<msb>27</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_lock</name>
								<lsb>26</lsb>
								<msb>26</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_lock</name>
								<lsb>25</lsb>
								<msb>25</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_lock</name>
								<lsb>24</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_en</name>
								<lsb>19</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_en</name>
								<lsb>18</lsb>
								<msb>18</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_en</name>
								<lsb>17</lsb>
								<msb>17</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_en</name>
								<lsb>16</lsb>
								<msb>16</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id1_en</name>
								<lsb>11</lsb>
								<msb>11</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id1_en</name>
								<lsb>10</lsb>
								<msb>10</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id1_en</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id1_en</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_id0_en</name>
								<lsb>3</lsb>
								<msb>3</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_id0_en</name>
								<lsb>2</lsb>
								<msb>2</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_id0_en</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_id0_en</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r0</name>
						<description>tzc_rom0_r0.</description>
						<addressOffset>0x44</addressOffset>
						<fields>
							<field>
								<name>tzc_rom0_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom0_r1</name>
						<description>tzc_rom0_r1.</description>
						<addressOffset>0x48</addressOffset>
						<fields>
							<field>
								<name>tzc_rom0_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom0_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r0</name>
						<description>tzc_rom1_r0.</description>
						<addressOffset>0x4C</addressOffset>
						<fields>
							<field>
								<name>tzc_rom1_r0_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r0_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>tzc_rom1_r1</name>
						<description>tzc_rom1_r1.</description>
						<addressOffset>0x50</addressOffset>
						<fields>
							<field>
								<name>tzc_rom1_r1_start</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>tzc_rom1_r1_end</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
