ckormanyos/real-time-cpp/ref_app/target/micros/bl602_sifive_e24_riscv/Code/Mcal/SoC_BL602.svd
					<register>
						<name>gpadc_reg_scn_neg2</name>
						<description>adc converation sequence 4</description>
						<addressOffset>0x924</addressOffset>
						<fields>
							<field>
								<name>gpadc_scan_neg_11</name>
								<lsb>25</lsb>
								<msb>29</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_10</name>
								<lsb>20</lsb>
								<msb>24</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_9</name>
								<lsb>15</lsb>
								<msb>19</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_8</name>
								<lsb>10</lsb>
								<msb>14</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_7</name>
								<lsb>5</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_scan_neg_6</name>
								<lsb>0</lsb>
								<msb>4</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_status</name>
						<description>gpadc_reg_status.</description>
						<addressOffset>0x928</addressOffset>
						<fields>
							<field>
								<name>gpadc_reserved</name>
								<lsb>16</lsb>
								<msb>31</msb>
							</field>
							<field>
								<name>gpadc_data_rdy</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_isr</name>
						<description>gpadc_reg_isr.</description>
						<addressOffset>0x92C</addressOffset>
						<fields>
							<field>
								<name>gpadc_pos_satur_mask</name>
								<lsb>9</lsb>
								<msb>9</msb>
							</field>
							<field>
								<name>gpadc_neg_satur_mask</name>
								<lsb>8</lsb>
								<msb>8</msb>
							</field>
							<field>
								<name>gpadc_pos_satur_clr</name>
								<lsb>5</lsb>
								<msb>5</msb>
							</field>
							<field>
								<name>gpadc_neg_satur_clr</name>
								<lsb>4</lsb>
								<msb>4</msb>
							</field>
							<field>
								<name>gpadc_pos_satur</name>
								<lsb>1</lsb>
								<msb>1</msb>
							</field>
							<field>
								<name>gpadc_neg_satur</name>
								<lsb>0</lsb>
								<msb>0</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_result</name>
						<description>gpadc_reg_result.</description>
						<addressOffset>0x930</addressOffset>
						<fields>
							<field>
								<name>gpadc_data_out</name>
								<lsb>0</lsb>
								<msb>25</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_raw_result</name>
						<description>gpadc_reg_raw_result.</description>
						<addressOffset>0x934</addressOffset>
						<fields>
							<field>
								<name>gpadc_raw_data</name>
								<lsb>0</lsb>
								<msb>11</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>gpadc_reg_define</name>
						<description>gpadc_reg_define.</description>
						<addressOffset>0x938</addressOffset>
						<fields>
							<field>
								<name>gpadc_os_cal_data</name>
								<lsb>0</lsb>
								<msb>15</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hbncore_resv0</name>
						<description>hbncore_resv0.</description>
						<addressOffset>0x93C</addressOffset>
						<fields>
							<field>
								<name>hbncore_resv0_data</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
					<register>
						<name>hbncore_resv1</name>
						<description>hbncore_resv1.</description>
						<addressOffset>0x940</addressOffset>
						<fields>
							<field>
								<name>hbncore_resv1_data</name>
								<lsb>0</lsb>
								<msb>31</msb>
							</field>
						</fields>
					</register>
				</registers>
			</peripheral>
		</peripherals>
	</device>